{
    "en": {
        "h1_service": "Recruitment Services",
        "h1_one": "International Recruitment Services.",
        "h1_one_details": "Want to expand your talent pool across borders? Our international recruitment services are designed to connect your business with top talent around the world. Whether you are looking for professional expat talent or looking to diversify your workforce, we provide tailor-made solutions to meet your recruitment needs.",
        "h1_two": "Talent A Placement Services.",
        "h1_two_details": "At Talent A Placement Services, we specialize in matching top-tier talent with leading companies. Our tailored placement solutions ensure that your business gets the right people, right when you need them.",
        "h1_three": "Company Formation Services.",
        "h1_three_details": "Launching a new business? Our Company Formation Services provide everything you need to establish your company with ease. From legal documentation to regulatory compliance, we’re here to guide you through every step of the process.",
        "h1_four": "Work Permit &Visa Application.",
        "h1_four_details": "The process of applying for a work permit and work visa is extremely complex. Our professional services are designed to make the process smooth and worry-free.",
        "h1_five": "Health , Safety , Environment Consulting and Training Services.",
        "h1_five_details": "We emphasize the importance of strict compliance with workplace health and safety regulations. Our team is focused on ensuring timely response to emergencies while emphasizing the need for comprehensive safety training and supervision.",
        "h1_six_details": "Unlock your business's full potential with our comprehensive Business Management and Training Services. We offer expert guidance and tailored training programs to help your team excel and your business thrive.",
        "h2_service": "Recruitment Road map",
        "h2_one": "Phase 1.",
        "h2_one_d": "Collect job requirements from the employer.",
        "h2_one_details": "We'll ensure you recruit the right candidates by clearly defining the job requirements. Our platform will collect detailed job requirements from companies and help you connect your company's recruitment positions with suitable candidates.",
        "h2_two": "Phase 2.",
        "h2_two_d": "Identify, evaluate, and present qualified candidates to the Employer.",
        "h2_two_details": "Our recruitment process is designed to ensure you receive only the most qualified candidates. We thoroughly identify, evaluate, and present the best talent to meet your specific needs, saving you time and resources.",
        "h2_three": "Phase 3.",
        "h2_three_d": "Coordinate and manage the interview process for both candidates and the employer.",
        "h2_three_details": "Streamline your recruitment process with our interview coordination services. We will ensure that the interview between the candidate and the company goes smoothly.",
        "h2_four": "Phase 4.",
        "h2_four_details": "Finding the right talent With IMMAHIRED, sending employment offers is quick and straightforward. Ensure your selected candidates receive their offers seamlessly.",
        "h2_four_d": "Employment Offer Sent to Selected Candidates via IMMA HIRED."
    },
    "cn": {
    "h1_service": "招聘服务",
    "h1_one": "国际招聘服务。",
    "h1_one_details": "想要跨国扩展您的人才库吗？我们的国际招聘服务旨在将您的企业与全球顶尖人才联系起来。无论您是在寻找专业的外籍人才还是希望多样化您的劳动力，我们都会提供量身定制的解决方案来满足您的招聘需求。",
    "h1_two": "人才安置服务。",
    "h1_two_details": "在人才安置服务中，我们专注于将顶尖人才与领先公司匹配。我们量身定制的安置解决方案确保您的企业在需要时得到合适的人才。",
    "h1_three": "公司成立服务。",
    "h1_three_details": "正在启动新业务？我们的公司成立服务提供您所需的一切，以便轻松建立公司。从法律文件到合规要求，我们在每一步都为您提供指导。",
    "h1_four": "工作许可证与签证申请。",
    "h1_four_details": "申请工作许可和工作签证的流程极其复杂。我们的专业服务旨在使这一过程顺利无忧。",
    "h1_five": "健康、安全、环境咨询与培训服务。",
    "h1_five_details": "我们强调严格遵守工作场所健康与安全规定的重要性。我们的团队专注于确保紧急情况的及时响应，同时强调需要进行全面的安全培训和监督。",
    "h1_six": "业务管理与培训服务。",
    "h1_six_details": "通过我们全面的业务管理与培训服务，释放您企业的全部潜力。我们提供专业指导和量身定制的培训项目，帮助您的团队出色表现，让您的企业蓬勃发展。",
    "h2_service": "招聘路线图",
    "h2_one": "阶段 1。",
    "h2_one_d": "收集企业的职位要求。",
    "h2_one_details": "我们将通过清晰地定义职位要求来确保您招聘合适的候选人。我们的平台将收集企业详细职位需求，帮助您将贵企业的招聘岗位与合适的候选人联系起来。",
    "h2_two": "阶段 2。",
    "h2_two_d": "识别、评估并向雇主推荐合格候选人。",
    "h2_two_details": "我们的招聘流程旨在确保您只接收最合格的候选人。我们会彻底识别、评估并呈现最佳人才，以满足您的特定需求，节省您的时间和资源。",
    "h2_three": "阶段 3。",
    "h2_three_d": "协调并管理候选人与雇主的面试过程。",
    "h2_three_details": "通过我们的面试协调服务简化您的招聘流程。我们将确保候选人与企业的面试顺利进行。",
    "h2_four": "阶段 4。",
    "h2_four_details": "找到合适的人才。通过IMMAHIRED，发送雇佣报价快速而简单。确保您选择的候选人无缝接收报价。",
    "h2_four_d": "通过IMMA HIRED向选定候选人发送雇佣报价。"
},
"es": {
    "h1_service": "Servicios de Reclutamiento",
    "h1_one": "Servicios de Reclutamiento Internacional.",
    "h1_one_details": "¿Quiere ampliar su grupo de talentos a través de fronteras? Nuestros servicios de contratación internacional están diseñados para conectar su empresa con los mejores talentos de todo el mundo. Ya sea que esté buscando talento profesional expatriado o diversificando su fuerza laboral, brindamos soluciones personalizadas para satisfacer sus necesidades de contratación.",
    "h1_two": "Servicios de Colocación de Talento A.",
    "h1_two_details": "En Servicios de Colocación de Talento A, nos especializamos en emparejar talento de primer nivel con empresas líderes. Nuestras soluciones de colocación personalizadas aseguran que tu negocio obtenga las personas adecuadas, justo cuando las necesitas.",
    "h1_three": "Servicios de Formación de Empresas.",
    "h1_three_details": "¿Estás lanzando un nuevo negocio? Nuestros Servicios de Formación de Empresas proporcionan todo lo que necesitas para establecer tu empresa con facilidad. Desde documentación legal hasta cumplimiento normativo, estamos aquí para guiarte en cada paso del proceso.",
    "h1_four": "Permisos de Trabajo y Solicitud de Visas.",
    "h1_four_details": "El proceso de solicitud de un permiso de trabajo y una visa de trabajo es extremadamente complejo. Nuestros servicios profesionales están diseñados para que el proceso sea sencillo y sin preocupaciones.",
    "h1_five": "Consultoría y Formación en Salud, Seguridad y Medio Ambiente.",
    "h1_five_details": "Destacamos la importancia del estricto cumplimiento de las normas de seguridad y salud en el trabajo. Nuestro equipo se centra en garantizar una respuesta oportuna a las emergencias y al mismo tiempo enfatiza la necesidad de una capacitación y supervisión integrales en seguridad.",
    "h1_six": "Servicios de Gestión Empresarial y Formación.",
    "h1_six_details": "Desbloquea todo el potencial de tu negocio con nuestros completos Servicios de Gestión Empresarial y Formación. Ofrecemos orientación experta y programas de formación personalizados para ayudar a tu equipo a sobresalir y a tu negocio a prosperar.",
    "h2_service": "Hoja de Ruta de Reclutamiento",
    "h2_one": "Fase 1.",
    "h2_one_d": "Recoger los requisitos del trabajo del empleador.",
    "h2_one_details": "Asegúrate de contratar a los candidatos adecuados definiendo claramente tus requisitos laborales. Nuestra plataforma facilita la recolección de especificaciones de trabajo detalladas de los empleadores, ayudándote a emparejar a los candidatos perfectos con sus necesidades.",
    "h2_two": "Fase 2.",
    "h2_two_d": "Identificar, evaluar y presentar candidatos calificados al empleador.",
    "h2_two_details": "Nos aseguraremos de que contrate a los candidatos adecuados definiendo claramente los requisitos del puesto. Nuestra plataforma recopilará requisitos laborales detallados de las empresas y le ayudará a conectar los puestos de contratación de su empresa con los candidatos adecuados.",
    "h2_three": "Fase 3.",
    "h2_three_d": "Coordinar y gestionar el proceso de entrevistas para candidatos y empleadores.",
    "h2_three_details": "Agilice su proceso de contratación con nuestros servicios de coordinación de entrevistas. Nos aseguraremos de que la entrevista entre el candidato y la empresa transcurra sin problemas.",
    "h2_four": "Fase 4.",
    "h2_four_details": "Encontrar el talento adecuado. Con IMMAHIRED, enviar ofertas de empleo es rápido y sencillo. Asegúrate de que tus candidatos seleccionados reciban sus ofertas sin inconvenientes.",
    "h2_four_d": "Oferta de empleo enviada a candidatos seleccionados a través de IMMA HIRED."
}

}