{
    "en": {
      "about": "ABOUT US",
      "details": "<b>IMMA HIRED</b> is pleased to offer Talent A recruitment services in the local and overseas employment market. As a trusted partner, we pride ourselves on being able to source top talent and provide highly experienced consultants who can oversee a project from inception to completion. Our dedicated team is committed to delivering a streamlined and transparent process to all of our clients, ensuring a seamless experience throughout the recruitment process.<br /><br /><b>IMMA HIRED</b> acknowledges the complexities that can arise when hiring and managing international staff, particularly across different countries and regions. Our team has extensive experience with overseas recruitment policies and is equipped to collaborate with your organization to facilitate a productive and successful partnership. We invite you to leverage our expertise to ensure a seamless integration of international staff into your workforce, while also meeting all relevant regulatory requirements.",
      "mission": "Our Mission",
      "details_m": "<p>Our team specializes in connecting a diverse pool of foreign professionals, high achievers, and emerging talents—including graduates with Master's, MBA, and PhD degrees—with opportunities in new and expanding job markets.</p><p className='text-2xl'><b>'Connecting Talents with Opportunities'</b></p>",
      "vision": "Our Vision",
      "details_v": "Our vision is to provide overseas Category A talents with job opportunities that are closely integrated with their skills, values ​​and career aspirations.",
      "founder": "Founder",
      "details_f_1": "Imma is versatile and professional. He always adheres to the customer-centric concept and has more than ten years of rich experience in customer service, consulting, management, business English training, security management, administration, human resources and organizational operations.",
      "details_f_2": "lmma has rich qualifications. He has ESL teaching, HSE consultant qualifications, relevant qualifications in training, safety audits and inspections, non-destructive testing, WHS management, education consultants, corporate management, and has an in-depth understanding of public relations, customer service and complaint management.",
      "details_f_3": "Imma connects global investors with various investment opportunities in Africa such as gold mining, solar energy, road infrastructure, healthcare and soda ash mining. Imma emphasizes the importance of strict compliance with workplace health and safety regulations. In his operations management role, he focuses on ensuring timely response to emergencies while emphasizing the need for comprehensive safety training and supervision. Imma is committed to creating a work environment that is inclusive and respectful for its employees. He emphasized prioritizing the health and well-being of employees and promoting the development of a safety-focused culture.",
      "team": "Our Team",
      "job_1": "Recruitment Specialist",
      "boss": "Imma Jing",
      "job_3": "Sales and Marketing Specialist",
      "job_4": "Senior Consultant & Recruitment Manager",
      "ceo": "CEO",
      "scan": "Scan",
      "contact": "Contact us",
      "contact_info": "Get in touch and let us know how we can help!"
    },
    "cn": {
      "about": "关于我们",
      "details": "<b>IMMA HIRED</b> 很荣幸能够为国内和海外就业市场提供 A 类人才招聘服务。作为您信赖的合作伙伴，我们以能够寻找顶尖人才并提供经验丰富的顾问服务为荣。我们的顾问将把项目从开始带到完成。我们的团队致力于为所有客户提供精简透明的招聘流程，确保客户在整个招聘过程中获得良好的体验。<br /><br /><b>IMMA HIRED</b> 意识到企业在跨国招聘和管理国际员工时可能会遇到的困难。我们的团队在海外招聘方面有着丰富的经验。我们希望能够与您的企业合作，以促进招聘的顺利进行。我们将利用我们的专业知识，在符合相关的法律法规的要求的前提下，确保国际员工顺利融入您的团队。",
      "mission": "我们的使命",
      "details_m": "<p>我们的团队将把来自不同国家的专业人士、高成就者、新兴人才以及拥有工程管理硕士、MBA和博士学位的毕业生与新市场的就业市场连接起来。</p> <p className='text-2xl'><b>'将人才与机会相连接'</b></p>",
      "vision": "我们的愿景",
      "details_v": "我们的愿景是为海外A 类人才提供与其技能、价值观和职业抱负紧密结合的工作机会。",
      "details_f_1": "Imma 多才多艺，工作专业，他始终秉承以客户为中心的理念，在客户服务、咨询、管理、商务英语培训、安全管理、行政、人力资源及机构运营等领域有着十余年的丰富经验。",
      "details_f_2": "lmma 资历丰富，他拥有ESL教学、HSE 顾问资格，有着培训、安全审计和检查、无损检测、WHS 管理、教育顾问、企业管理的相关资质，对公共关系、客户服务和投诉管理有深入了解。",
      "details_f_3": "Imma将全球投资者与非洲的各种投资机会联系起来，如黄金开采、太阳能、道路基础设施、医疗保健和纯碱开采等。Imma强调严格遵守工作场所健康与安全规定的重要性。在运营管理职位上，他专注于确保紧急情况的及时响应，同时强调需要进行全面的安全培训和监督。Imma致力于营造一个包容和尊重员工的工作环境。他强调优先考虑员工的健康和福祉，并促进重视安全文化的发展。",
      "team": "我们的团队",
      "job_1": "招聘专员",
      "boss": "京伊玛",
      "job_3": "销售和营销专员",
      "job_4": "高级顾问兼招聘经理",
      "ceo": "首席执行官"
    },
    "es": {
      "about": "SOBRE NOSOTROS",
      "details": "<b>IMMA HIRED</b> se complace en ofrecer servicios de reclutamiento de Talento A en el mercado laboral local y en el extranjero. Como socio de confianza, nos enorgullecemos de poder encontrar talento de primer nivel y proporcionar consultores con gran experiencia que puedan supervisar un proyecto desde su inicio hasta su finalización. Nuestro equipo está dedicado a ofrecer un proceso optimizado y transparente a todos nuestros clientes, asegurando una experiencia fluida a lo largo del proceso de reclutamiento.<br /><br /><b>IMMA HIRED</b> reconoce las complejidades que pueden surgir al contratar y gestionar personal internacional, particularmente en diferentes países y regiones. Nuestro equipo tiene amplia experiencia con las políticas de reclutamiento en el extranjero y está equipado para colaborar con su organización para facilitar una asociación productiva y exitosa. Le invitamos a aprovechar nuestra experiencia para asegurar una integración sin problemas del personal internacional en su fuerza laboral, al tiempo que se cumplen todos los requisitos normativos relevantes.",
      "mission": "Nuestra Misión",
      "details_m": "<p>Nuestro equipo conectará a diversos profesionales extranjeros, personas de alto rendimiento, talentos emergentes y graduados con títulos de Maestría, MBA y Doctorado en Gestión de Ingeniería con el mercado laboral en nuevos mercados.</p> <p className='text-2xl'><b>'Conectando Talentos con Oportunidades'</b></p>",
      "vision": "Nuestra Visión",
      "details_v": "Nuestra visión es ser un proveedor líder de soluciones de adquisición de Talento A, brindando oportunidades para que individuos excepcionales se conecten con organizaciones que se alineen estrechamente con sus habilidades, valores y aspiraciones profesionales.",
      "founder": "Fundador",
      "details_f_1": "Imma es un profesional experimentado con más de una década de experiencia en iniciativas centradas en el cliente, incluyendo consultoría, gestión, capacitación y seguridad en el lugar de trabajo. Sus lazos con el Instituto de Seguridad y Salud Ocupacional (IOSH) en el Reino Unido demuestran su compromiso con la seguridad. También tiene experiencia en reclutamiento internacional y procesos de visas, lo que lo convierte en un activo valioso para nuestra organización.",
      "details_f_2": "Imma tiene ricas calificaciones. Tiene enseñanza de ESL, calificaciones de consultor de HSE, calificaciones relevantes en capacitación, auditorías e inspecciones de seguridad, pruebas no destructivas, gestión de WHS, consultores educativos, gestión corporativa y tiene un profundo conocimiento de las relaciones públicas y del cliente. atención y gestión de reclamaciones.",
      "details_f_3": "Imma conecta a inversores globales con diversas oportunidades de inversión en África, como minería de oro, energía solar, infraestructura vial, atención médica y minería de carbonato de sodio. Imma destaca la importancia del cumplimiento estricto de las normas de seguridad y salud en el trabajo. En su función de gestión de operaciones, se centra en garantizar una respuesta oportuna a las emergencias y al mismo tiempo enfatiza la necesidad de una capacitación y supervisión integrales en seguridad. Imma se compromete a crear un ambiente de trabajo inclusivo y respetuoso para sus empleados. Enfatizó priorizar la salud y el bienestar de los empleados y promover el desarrollo de una cultura enfocada en la seguridad.",
      "team": "Nuestro Equipo",
      "job_1": "Especialista en Reclutamiento",
      "boss": "jingyima",
      "job_3": "Especialista en Ventas y Marketing",
      "job_4": "Consultor Senior y Gerente de Reclutamiento",
      "ceo": "director ejecutivo"
    }
  }
  
